<?php
	class Friend extends Model
	{
	
		/*====================================== ПЕРЕМЕННЫЕ И КОНСТАНТЫ ======================================*/

		public static $mysql_table	= "friends";
		
		/*====================================== СИСТЕМНЫЕ ФУНКЦИИ ======================================*/
		
		
		
		/*====================================== СТАТИЧЕСКИЕ ФУНКЦИИ ======================================*/
		
		/*
		 * Функция определяет соединение БД
		 */
		public static function dbConnection()
		{
			return dbUser();	// БД user_x
		}
		
		/*
		 * Добавить друга по id_user
		 */
		public static function add($id_user)
		{
			// Если такой друг уже есть
			if (self::findById($id_user)) {
				return false;
			} else {
			// Иначе добавляем друга
				$Friend = new Friend(array(
					"id_user" => $id_user,
				));
				
				return $Friend->save();	
			}
		}
		
		/*====================================== ФУНКЦИИ КЛАССА ======================================*/

		
	}